zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/include/pio/pic32ck1012sg00100.h
#define PIN_PC11K_PCC_DATA6                        _UINT32_(75)
#define MUX_PC11K_PCC_DATA6                        _UINT32_(10)
#define PINMUX_PC11K_PCC_DATA6                     ((PIN_PC11K_PCC_DATA6 << 16) | MUX_PC11K_PCC_DATA6)
#define PORT_PC11K_PCC_DATA6                       (_UINT32_(1) << 11)

#define PIN_PC00K_PCC_DATA7                        _UINT32_(64)
#define MUX_PC00K_PCC_DATA7                        _UINT32_(10)
#define PINMUX_PC00K_PCC_DATA7                     ((PIN_PC00K_PCC_DATA7 << 16) | MUX_PC00K_PCC_DATA7)
#define PORT_PC00K_PCC_DATA7                       (_UINT32_(1) << 0)

#define PIN_PC15K_PCC_DATA8                        _UINT32_(79)
#define MUX_PC15K_PCC_DATA8                        _UINT32_(10)
#define PINMUX_PC15K_PCC_DATA8                     ((PIN_PC15K_PCC_DATA8 << 16) | MUX_PC15K_PCC_DATA8)
#define PORT_PC15K_PCC_DATA8                       (_UINT32_(1) << 15)

#define PIN_PC16K_PCC_DATA9                        _UINT32_(80)
#define MUX_PC16K_PCC_DATA9                        _UINT32_(10)
#define PINMUX_PC16K_PCC_DATA9                     ((PIN_PC16K_PCC_DATA9 << 16) | MUX_PC16K_PCC_DATA9)
#define PORT_PC16K_PCC_DATA9                       (_UINT32_(1) << 16)

#define PIN_PC17K_PCC_DATA10                       _UINT32_(81)
#define MUX_PC17K_PCC_DATA10                       _UINT32_(10)
#define PINMUX_PC17K_PCC_DATA10                    ((PIN_PC17K_PCC_DATA10 << 16) | MUX_PC17K_PCC_DATA10)
#define PORT_PC17K_PCC_DATA10                      (_UINT32_(1) << 17)

#define PIN_PC18K_PCC_DATA11                       _UINT32_(82)
#define MUX_PC18K_PCC_DATA11                       _UINT32_(10)
#define PINMUX_PC18K_PCC_DATA11                    ((PIN_PC18K_PCC_DATA11 << 16) | MUX_PC18K_PCC_DATA11)
#define PORT_PC18K_PCC_DATA11                      (_UINT32_(1) << 18)

#define PIN_PC19K_PCC_DATA12                       _UINT32_(83)
#define MUX_PC19K_PCC_DATA12                       _UINT32_(10)
#define PINMUX_PC19K_PCC_DATA12                    ((PIN_PC19K_PCC_DATA12 << 16) | MUX_PC19K_PCC_DATA12)
#define PORT_PC19K_PCC_DATA12                      (_UINT32_(1) << 19)

#define PIN_PC20K_PCC_DATA13                       _UINT32_(84)
#define MUX_PC20K_PCC_DATA13                       _UINT32_(10)
#define PINMUX_PC20K_PCC_DATA13                    ((PIN_PC20K_PCC_DATA13 << 16) | MUX_PC20K_PCC_DATA13)
#define PORT_PC20K_PCC_DATA13                      (_UINT32_(1) << 20)

#define PIN_PA10K_PCC_DEN1                         _UINT32_(10)
#define MUX_PA10K_PCC_DEN1                         _UINT32_(10)
#define PINMUX_PA10K_PCC_DEN1                      ((PIN_PA10K_PCC_DEN1 << 16) | MUX_PA10K_PCC_DEN1)
#define PORT_PA10K_PCC_DEN1                        (_UINT32_(1) << 10)

#define PIN_PC04K_PCC_DEN1                         _UINT32_(68)
#define MUX_PC04K_PCC_DEN1                         _UINT32_(10)
#define PINMUX_PC04K_PCC_DEN1                      ((PIN_PC04K_PCC_DEN1 << 16) | MUX_PC04K_PCC_DEN1)
#define PORT_PC04K_PCC_DEN1                        (_UINT32_(1) << 4)

#define PIN_PC14K_PCC_DEN2                         _UINT32_(78)
#define MUX_PC14K_PCC_DEN2                         _UINT32_(10)
#define PINMUX_PC14K_PCC_DEN2                      ((PIN_PC14K_PCC_DEN2 << 16) | MUX_PC14K_PCC_DEN2)
#define PORT_PC14K_PCC_DEN2                        (_UINT32_(1) << 14)

#define PIN_PD02K_PCC_DEN2                         _UINT32_(98)
#define MUX_PD02K_PCC_DEN2                         _UINT32_(10)
#define PINMUX_PD02K_PCC_DEN2                      ((PIN_PD02K_PCC_DEN2 << 16) | MUX_PD02K_PCC_DEN2)
#define PORT_PD02K_PCC_DEN2                        (_UINT32_(1) << 2)

/* ================== PORT definition for PDEC peripheral =================== */
#define PIN_PB04G_PDEC_QDI0                        _UINT32_(36)
#define MUX_PB04G_PDEC_QDI0                        _UINT32_(6) 
#define PINMUX_PB04G_PDEC_QDI0                     ((PIN_PB04G_PDEC_QDI0 << 16) | MUX_PB04G_PDEC_QDI0)
#define PORT_PB04G_PDEC_QDI0                       (_UINT32_(1) << 4)

#define PIN_PB07G_PDEC_QDI0                        _UINT32_(39)
#define MUX_PB07G_PDEC_QDI0                        _UINT32_(6) 
#define PINMUX_PB07G_PDEC_QDI0                     ((PIN_PB07G_PDEC_QDI0 << 16) | MUX_PB07G_PDEC_QDI0)
#define PORT_PB07G_PDEC_QDI0                       (_UINT32_(1) << 7)

#define PIN_PB05G_PDEC_QDI1                        _UINT32_(37)
#define MUX_PB05G_PDEC_QDI1                        _UINT32_(6) 
#define PINMUX_PB05G_PDEC_QDI1                     ((PIN_PB05G_PDEC_QDI1 << 16) | MUX_PB05G_PDEC_QDI1)
#define PORT_PB05G_PDEC_QDI1                       (_UINT32_(1) << 5)

#define PIN_PB08G_PDEC_QDI1                        _UINT32_(40)
#define MUX_PB08G_PDEC_QDI1                        _UINT32_(6) 
#define PINMUX_PB08G_PDEC_QDI1                     ((PIN_PB08G_PDEC_QDI1 << 16) | MUX_PB08G_PDEC_QDI1)
#define PORT_PB08G_PDEC_QDI1                       (_UINT32_(1) << 8)

#define PIN_PB06G_PDEC_QDI2                        _UINT32_(38)
#define MUX_PB06G_PDEC_QDI2                        _UINT32_(6) 
#define PINMUX_PB06G_PDEC_QDI2                     ((PIN_PB06G_PDEC_QDI2 << 16) | MUX_PB06G_PDEC_QDI2)
#define PORT_PB06G_PDEC_QDI2                       (_UINT32_(1) << 6)

#define PIN_PB09G_PDEC_QDI2                        _UINT32_(41)
#define MUX_PB09G_PDEC_QDI2                        _UINT32_(6) 
#define PINMUX_PB09G_PDEC_QDI2                     ((PIN_PB09G_PDEC_QDI2 << 16) | MUX_PB09G_PDEC_QDI2)
#define PORT_PB09G_PDEC_QDI2                       (_UINT32_(1) << 9)

#define PIN_PB13G_PDEC_QDI2                        _UINT32_(45)
#define MUX_PB13G_PDEC_QDI2                        _UINT32_(6) 
#define PINMUX_PB13G_PDEC_QDI2                     ((PIN_PB13G_PDEC_QDI2 << 16) | MUX_PB13G_PDEC_QDI2)
#define PORT_PB13G_PDEC_QDI2                       (_UINT32_(1) << 13)

/* =================== PORT definition for PTC peripheral =================== */
#define PIN_PA09N_PTC_DRV0                         _UINT32_(9) 
#define MUX_PA09N_PTC_DRV0                         _UINT32_(13)
#define PINMUX_PA09N_PTC_DRV0                      ((PIN_PA09N_PTC_DRV0 << 16) | MUX_PA09N_PTC_DRV0)
#define PORT_PA09N_PTC_DRV0                        (_UINT32_(1) << 9)

#define PIN_PA10N_PTC_DRV1                         _UINT32_(10)
#define MUX_PA10N_PTC_DRV1                         _UINT32_(13)
#define PINMUX_PA10N_PTC_DRV1                      ((PIN_PA10N_PTC_DRV1 << 16) | MUX_PA10N_PTC_DRV1)
#define PORT_PA10N_PTC_DRV1                        (_UINT32_(1) << 10)

#define PIN_PA11N_PTC_DRV2                         _UINT32_(11)
#define MUX_PA11N_PTC_DRV2                         _UINT32_(13)
#define PINMUX_PA11N_PTC_DRV2                      ((PIN_PA11N_PTC_DRV2 << 16) | MUX_PA11N_PTC_DRV2)
#define PORT_PA11N_PTC_DRV2                        (_UINT32_(1) << 11)

#define PIN_PA12N_PTC_DRV3                         _UINT32_(12)
#define MUX_PA12N_PTC_DRV3                         _UINT32_(13)
#define PINMUX_PA12N_PTC_DRV3                      ((PIN_PA12N_PTC_DRV3 << 16) | MUX_PA12N_PTC_DRV3)
#define PORT_PA12N_PTC_DRV3                        (_UINT32_(1) << 12)

#define PIN_PB00N_PTC_DRV4                         _UINT32_(32)
#define MUX_PB00N_PTC_DRV4                         _UINT32_(13)
#define PINMUX_PB00N_PTC_DRV4                      ((PIN_PB00N_PTC_DRV4 << 16) | MUX_PB00N_PTC_DRV4)
#define PORT_PB00N_PTC_DRV4                        (_UINT32_(1) << 0)

#define PIN_PB01N_PTC_DRV5                         _UINT32_(33)
#define MUX_PB01N_PTC_DRV5                         _UINT32_(13)
#define PINMUX_PB01N_PTC_DRV5                      ((PIN_PB01N_PTC_DRV5 << 16) | MUX_PB01N_PTC_DRV5)
#define PORT_PB01N_PTC_DRV5                        (_UINT32_(1) << 1)

#define PIN_PB07N_PTC_DRV6                         _UINT32_(39)
#define MUX_PB07N_PTC_DRV6                         _UINT32_(13)
#define PINMUX_PB07N_PTC_DRV6                      ((PIN_PB07N_PTC_DRV6 << 16) | MUX_PB07N_PTC_DRV6)
#define PORT_PB07N_PTC_DRV6                        (_UINT32_(1) << 7)

