zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/include/pio/pic32ck1012sg00100.h
#define PIN_PC06D_SERCOM3_PAD1                     _UINT32_(70)
#define MUX_PC06D_SERCOM3_PAD1                     _UINT32_(3) 
#define PINMUX_PC06D_SERCOM3_PAD1                  ((PIN_PC06D_SERCOM3_PAD1 << 16) | MUX_PC06D_SERCOM3_PAD1)
#define PORT_PC06D_SERCOM3_PAD1                    (_UINT32_(1) << 6)

#define PIN_PB17C_SERCOM3_PAD1                     _UINT32_(49)
#define MUX_PB17C_SERCOM3_PAD1                     _UINT32_(2) 
#define PINMUX_PB17C_SERCOM3_PAD1                  ((PIN_PB17C_SERCOM3_PAD1 << 16) | MUX_PB17C_SERCOM3_PAD1)
#define PORT_PB17C_SERCOM3_PAD1                    (_UINT32_(1) << 17)

#define PIN_PC03C_SERCOM3_PAD1                     _UINT32_(67)
#define MUX_PC03C_SERCOM3_PAD1                     _UINT32_(2) 
#define PINMUX_PC03C_SERCOM3_PAD1                  ((PIN_PC03C_SERCOM3_PAD1 << 16) | MUX_PC03C_SERCOM3_PAD1)
#define PORT_PC03C_SERCOM3_PAD1                    (_UINT32_(1) << 3)

#define PIN_PC01D_SERCOM3_PAD2                     _UINT32_(65)
#define MUX_PC01D_SERCOM3_PAD2                     _UINT32_(3) 
#define PINMUX_PC01D_SERCOM3_PAD2                  ((PIN_PC01D_SERCOM3_PAD2 << 16) | MUX_PC01D_SERCOM3_PAD2)
#define PORT_PC01D_SERCOM3_PAD2                    (_UINT32_(1) << 1)

#define PIN_PC09D_SERCOM3_PAD2                     _UINT32_(73)
#define MUX_PC09D_SERCOM3_PAD2                     _UINT32_(3) 
#define PINMUX_PC09D_SERCOM3_PAD2                  ((PIN_PC09D_SERCOM3_PAD2 << 16) | MUX_PC09D_SERCOM3_PAD2)
#define PORT_PC09D_SERCOM3_PAD2                    (_UINT32_(1) << 9)

#define PIN_PB07C_SERCOM3_PAD2                     _UINT32_(39)
#define MUX_PB07C_SERCOM3_PAD2                     _UINT32_(2) 
#define PINMUX_PB07C_SERCOM3_PAD2                  ((PIN_PB07C_SERCOM3_PAD2 << 16) | MUX_PB07C_SERCOM3_PAD2)
#define PORT_PB07C_SERCOM3_PAD2                    (_UINT32_(1) << 7)

#define PIN_PC04C_SERCOM3_PAD2                     _UINT32_(68)
#define MUX_PC04C_SERCOM3_PAD2                     _UINT32_(2) 
#define PINMUX_PC04C_SERCOM3_PAD2                  ((PIN_PC04C_SERCOM3_PAD2 << 16) | MUX_PC04C_SERCOM3_PAD2)
#define PORT_PC04C_SERCOM3_PAD2                    (_UINT32_(1) << 4)

#define PIN_PC00D_SERCOM3_PAD3                     _UINT32_(64)
#define MUX_PC00D_SERCOM3_PAD3                     _UINT32_(3) 
#define PINMUX_PC00D_SERCOM3_PAD3                  ((PIN_PC00D_SERCOM3_PAD3 << 16) | MUX_PC00D_SERCOM3_PAD3)
#define PORT_PC00D_SERCOM3_PAD3                    (_UINT32_(1) << 0)

#define PIN_PC15D_SERCOM3_PAD3                     _UINT32_(79)
#define MUX_PC15D_SERCOM3_PAD3                     _UINT32_(3) 
#define PINMUX_PC15D_SERCOM3_PAD3                  ((PIN_PC15D_SERCOM3_PAD3 << 16) | MUX_PC15D_SERCOM3_PAD3)
#define PORT_PC15D_SERCOM3_PAD3                    (_UINT32_(1) << 15)

#define PIN_PB08C_SERCOM3_PAD3                     _UINT32_(40)
#define MUX_PB08C_SERCOM3_PAD3                     _UINT32_(2) 
#define PINMUX_PB08C_SERCOM3_PAD3                  ((PIN_PB08C_SERCOM3_PAD3 << 16) | MUX_PB08C_SERCOM3_PAD3)
#define PORT_PB08C_SERCOM3_PAD3                    (_UINT32_(1) << 8)

#define PIN_PC05C_SERCOM3_PAD3                     _UINT32_(69)
#define MUX_PC05C_SERCOM3_PAD3                     _UINT32_(2) 
#define PINMUX_PC05C_SERCOM3_PAD3                  ((PIN_PC05C_SERCOM3_PAD3 << 16) | MUX_PC05C_SERCOM3_PAD3)
#define PORT_PC05C_SERCOM3_PAD3                    (_UINT32_(1) << 5)

/* ================= PORT definition for SERCOM4 peripheral ================= */
#define PIN_PB04D_SERCOM4_PAD0                     _UINT32_(36)
#define MUX_PB04D_SERCOM4_PAD0                     _UINT32_(3) 
#define PINMUX_PB04D_SERCOM4_PAD0                  ((PIN_PB04D_SERCOM4_PAD0 << 16) | MUX_PB04D_SERCOM4_PAD0)
#define PORT_PB04D_SERCOM4_PAD0                    (_UINT32_(1) << 4)

#define PIN_PB10D_SERCOM4_PAD0                     _UINT32_(42)
#define MUX_PB10D_SERCOM4_PAD0                     _UINT32_(3) 
#define PINMUX_PB10D_SERCOM4_PAD0                  ((PIN_PB10D_SERCOM4_PAD0 << 16) | MUX_PB10D_SERCOM4_PAD0)
#define PORT_PB10D_SERCOM4_PAD0                    (_UINT32_(1) << 10)

#define PIN_PB04C_SERCOM4_PAD0                     _UINT32_(36)
#define MUX_PB04C_SERCOM4_PAD0                     _UINT32_(2) 
#define PINMUX_PB04C_SERCOM4_PAD0                  ((PIN_PB04C_SERCOM4_PAD0 << 16) | MUX_PB04C_SERCOM4_PAD0)
#define PORT_PB04C_SERCOM4_PAD0                    (_UINT32_(1) << 4)

#define PIN_PB09C_SERCOM4_PAD0                     _UINT32_(41)
#define MUX_PB09C_SERCOM4_PAD0                     _UINT32_(2) 
#define PINMUX_PB09C_SERCOM4_PAD0                  ((PIN_PB09C_SERCOM4_PAD0 << 16) | MUX_PB09C_SERCOM4_PAD0)
#define PORT_PB09C_SERCOM4_PAD0                    (_UINT32_(1) << 9)

#define PIN_PB05D_SERCOM4_PAD1                     _UINT32_(37)
#define MUX_PB05D_SERCOM4_PAD1                     _UINT32_(3) 
#define PINMUX_PB05D_SERCOM4_PAD1                  ((PIN_PB05D_SERCOM4_PAD1 << 16) | MUX_PB05D_SERCOM4_PAD1)
#define PORT_PB05D_SERCOM4_PAD1                    (_UINT32_(1) << 5)

#define PIN_PB09D_SERCOM4_PAD1                     _UINT32_(41)
#define MUX_PB09D_SERCOM4_PAD1                     _UINT32_(3) 
#define PINMUX_PB09D_SERCOM4_PAD1                  ((PIN_PB09D_SERCOM4_PAD1 << 16) | MUX_PB09D_SERCOM4_PAD1)
#define PORT_PB09D_SERCOM4_PAD1                    (_UINT32_(1) << 9)

#define PIN_PB05C_SERCOM4_PAD1                     _UINT32_(37)
#define MUX_PB05C_SERCOM4_PAD1                     _UINT32_(2) 
#define PINMUX_PB05C_SERCOM4_PAD1                  ((PIN_PB05C_SERCOM4_PAD1 << 16) | MUX_PB05C_SERCOM4_PAD1)
#define PORT_PB05C_SERCOM4_PAD1                    (_UINT32_(1) << 5)

#define PIN_PB10C_SERCOM4_PAD1                     _UINT32_(42)
#define MUX_PB10C_SERCOM4_PAD1                     _UINT32_(2) 
#define PINMUX_PB10C_SERCOM4_PAD1                  ((PIN_PB10C_SERCOM4_PAD1 << 16) | MUX_PB10C_SERCOM4_PAD1)
#define PORT_PB10C_SERCOM4_PAD1                    (_UINT32_(1) << 10)

#define PIN_PA10D_SERCOM4_PAD2                     _UINT32_(10)
#define MUX_PA10D_SERCOM4_PAD2                     _UINT32_(3) 
#define PINMUX_PA10D_SERCOM4_PAD2                  ((PIN_PA10D_SERCOM4_PAD2 << 16) | MUX_PA10D_SERCOM4_PAD2)
#define PORT_PA10D_SERCOM4_PAD2                    (_UINT32_(1) << 10)

