zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/include/pio/pic32ck1012sg00100.h
#define PIN_PD07J_SPI_IXS_SDI                      _UINT32_(103)
#define MUX_PD07J_SPI_IXS_SDI                      _UINT32_(9) 
#define PINMUX_PD07J_SPI_IXS_SDI                   ((PIN_PD07J_SPI_IXS_SDI << 16) | MUX_PD07J_SPI_IXS_SDI)
#define PORT_PD07J_SPI_IXS_SDI                     (_UINT32_(1) << 7)

#define PIN_PB00J_SPI_IXS_SDO                      _UINT32_(32)
#define MUX_PB00J_SPI_IXS_SDO                      _UINT32_(9) 
#define PINMUX_PB00J_SPI_IXS_SDO                   ((PIN_PB00J_SPI_IXS_SDO << 16) | MUX_PB00J_SPI_IXS_SDO)
#define PORT_PB00J_SPI_IXS_SDO                     (_UINT32_(1) << 0)

#define PIN_PD08J_SPI_IXS_SDO                      _UINT32_(104)
#define MUX_PD08J_SPI_IXS_SDO                      _UINT32_(9) 
#define PINMUX_PD08J_SPI_IXS_SDO                   ((PIN_PD08J_SPI_IXS_SDO << 16) | MUX_PD08J_SPI_IXS_SDO)
#define PORT_PD08J_SPI_IXS_SDO                     (_UINT32_(1) << 8)

/* =================== PORT definition for SQI peripheral =================== */
#define PIN_PC06P_SQI_CLK                          _UINT32_(70)
#define MUX_PC06P_SQI_CLK                          _UINT32_(15)
#define PINMUX_PC06P_SQI_CLK                       ((PIN_PC06P_SQI_CLK << 16) | MUX_PC06P_SQI_CLK)
#define PORT_PC06P_SQI_CLK                         (_UINT32_(1) << 6)

#define PIN_PD10H_SQI_CLK                          _UINT32_(106)
#define MUX_PD10H_SQI_CLK                          _UINT32_(7) 
#define PINMUX_PD10H_SQI_CLK                       ((PIN_PD10H_SQI_CLK << 16) | MUX_PD10H_SQI_CLK)
#define PORT_PD10H_SQI_CLK                         (_UINT32_(1) << 10)

#define PIN_PC01P_SQI_CS0                          _UINT32_(65)
#define MUX_PC01P_SQI_CS0                          _UINT32_(15)
#define PINMUX_PC01P_SQI_CS0                       ((PIN_PC01P_SQI_CS0 << 16) | MUX_PC01P_SQI_CS0)
#define PORT_PC01P_SQI_CS0                         (_UINT32_(1) << 1)

#define PIN_PD06H_SQI_CS0                          _UINT32_(102)
#define MUX_PD06H_SQI_CS0                          _UINT32_(7) 
#define PINMUX_PD06H_SQI_CS0                       ((PIN_PD06H_SQI_CS0 << 16) | MUX_PD06H_SQI_CS0)
#define PORT_PD06H_SQI_CS0                         (_UINT32_(1) << 6)

#define PIN_PC00P_SQI_CS1                          _UINT32_(64)
#define MUX_PC00P_SQI_CS1                          _UINT32_(15)
#define PINMUX_PC00P_SQI_CS1                       ((PIN_PC00P_SQI_CS1 << 16) | MUX_PC00P_SQI_CS1)
#define PORT_PC00P_SQI_CS1                         (_UINT32_(1) << 0)

#define PIN_PD05H_SQI_CS1                          _UINT32_(101)
#define MUX_PD05H_SQI_CS1                          _UINT32_(7) 
#define PINMUX_PD05H_SQI_CS1                       ((PIN_PD05H_SQI_CS1 << 16) | MUX_PD05H_SQI_CS1)
#define PORT_PD05H_SQI_CS1                         (_UINT32_(1) << 5)

#define PIN_PA10H_SQI_CS2                          _UINT32_(10)
#define MUX_PA10H_SQI_CS2                          _UINT32_(7) 
#define PINMUX_PA10H_SQI_CS2                       ((PIN_PA10H_SQI_CS2 << 16) | MUX_PA10H_SQI_CS2)
#define PORT_PA10H_SQI_CS2                         (_UINT32_(1) << 10)

#define PIN_PD12H_SQI_CS3                          _UINT32_(108)
#define MUX_PD12H_SQI_CS3                          _UINT32_(7) 
#define PINMUX_PD12H_SQI_CS3                       ((PIN_PD12H_SQI_CS3 << 16) | MUX_PD12H_SQI_CS3)
#define PORT_PD12H_SQI_CS3                         (_UINT32_(1) << 12)

#define PIN_PC02P_SQI_DATA0                        _UINT32_(66)
#define MUX_PC02P_SQI_DATA0                        _UINT32_(15)
#define PINMUX_PC02P_SQI_DATA0                     ((PIN_PC02P_SQI_DATA0 << 16) | MUX_PC02P_SQI_DATA0)
#define PORT_PC02P_SQI_DATA0                       (_UINT32_(1) << 2)

#define PIN_PD07H_SQI_DATA0                        _UINT32_(103)
#define MUX_PD07H_SQI_DATA0                        _UINT32_(7) 
#define PINMUX_PD07H_SQI_DATA0                     ((PIN_PD07H_SQI_DATA0 << 16) | MUX_PD07H_SQI_DATA0)
#define PORT_PD07H_SQI_DATA0                       (_UINT32_(1) << 7)

#define PIN_PC07P_SQI_DATA1                        _UINT32_(71)
#define MUX_PC07P_SQI_DATA1                        _UINT32_(15)
#define PINMUX_PC07P_SQI_DATA1                     ((PIN_PC07P_SQI_DATA1 << 16) | MUX_PC07P_SQI_DATA1)
#define PORT_PC07P_SQI_DATA1                       (_UINT32_(1) << 7)

#define PIN_PD11H_SQI_DATA1                        _UINT32_(107)
#define MUX_PD11H_SQI_DATA1                        _UINT32_(7) 
#define PINMUX_PD11H_SQI_DATA1                     ((PIN_PD11H_SQI_DATA1 << 16) | MUX_PD11H_SQI_DATA1)
#define PORT_PD11H_SQI_DATA1                       (_UINT32_(1) << 11)

#define PIN_PC03P_SQI_DATA2                        _UINT32_(67)
#define MUX_PC03P_SQI_DATA2                        _UINT32_(15)
#define PINMUX_PC03P_SQI_DATA2                     ((PIN_PC03P_SQI_DATA2 << 16) | MUX_PC03P_SQI_DATA2)
#define PORT_PC03P_SQI_DATA2                       (_UINT32_(1) << 3)

#define PIN_PD08H_SQI_DATA2                        _UINT32_(104)
#define MUX_PD08H_SQI_DATA2                        _UINT32_(7) 
#define PINMUX_PD08H_SQI_DATA2                     ((PIN_PD08H_SQI_DATA2 << 16) | MUX_PD08H_SQI_DATA2)
#define PORT_PD08H_SQI_DATA2                       (_UINT32_(1) << 8)

#define PIN_PC05P_SQI_DATA3                        _UINT32_(69)
#define MUX_PC05P_SQI_DATA3                        _UINT32_(15)
#define PINMUX_PC05P_SQI_DATA3                     ((PIN_PC05P_SQI_DATA3 << 16) | MUX_PC05P_SQI_DATA3)
#define PORT_PC05P_SQI_DATA3                       (_UINT32_(1) << 5)

#define PIN_PD09H_SQI_DATA3                        _UINT32_(105)
#define MUX_PD09H_SQI_DATA3                        _UINT32_(7) 
#define PINMUX_PD09H_SQI_DATA3                     ((PIN_PD09H_SQI_DATA3 << 16) | MUX_PD09H_SQI_DATA3)
#define PORT_PD09H_SQI_DATA3                       (_UINT32_(1) << 9)

/* ================== PORT definition for TCC0 peripheral =================== */
#define PIN_PB10G_TCC0_WO0                         _UINT32_(42)
#define MUX_PB10G_TCC0_WO0                         _UINT32_(6) 
#define PINMUX_PB10G_TCC0_WO0                      ((PIN_PB10G_TCC0_WO0 << 16) | MUX_PB10G_TCC0_WO0)
#define PORT_PB10G_TCC0_WO0                        (_UINT32_(1) << 10)

#define PIN_PB04F_TCC0_WO0                         _UINT32_(36)
#define MUX_PB04F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PB04F_TCC0_WO0                      ((PIN_PB04F_TCC0_WO0 << 16) | MUX_PB04F_TCC0_WO0)
#define PORT_PB04F_TCC0_WO0                        (_UINT32_(1) << 4)

