zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/include/pio/pic32ck1012sg00100.h
#define PIN_PB11G_TCC3_WO6                         _UINT32_(43)
#define MUX_PB11G_TCC3_WO6                         _UINT32_(6) 
#define PINMUX_PB11G_TCC3_WO6                      ((PIN_PB11G_TCC3_WO6 << 16) | MUX_PB11G_TCC3_WO6)
#define PORT_PB11G_TCC3_WO6                        (_UINT32_(1) << 11)

#define PIN_PA07G_TCC3_WO7                         _UINT32_(7) 
#define MUX_PA07G_TCC3_WO7                         _UINT32_(6) 
#define PINMUX_PA07G_TCC3_WO7                      ((PIN_PA07G_TCC3_WO7 << 16) | MUX_PA07G_TCC3_WO7)
#define PORT_PA07G_TCC3_WO7                        (_UINT32_(1) << 7)

#define PIN_PB12G_TCC3_WO7                         _UINT32_(44)
#define MUX_PB12G_TCC3_WO7                         _UINT32_(6) 
#define PINMUX_PB12G_TCC3_WO7                      ((PIN_PB12G_TCC3_WO7 << 16) | MUX_PB12G_TCC3_WO7)
#define PORT_PB12G_TCC3_WO7                        (_UINT32_(1) << 12)

#define PIN_PA19F_TCC3_WO7                         _UINT32_(19)
#define MUX_PA19F_TCC3_WO7                         _UINT32_(5) 
#define PINMUX_PA19F_TCC3_WO7                      ((PIN_PA19F_TCC3_WO7 << 16) | MUX_PA19F_TCC3_WO7)
#define PORT_PA19F_TCC3_WO7                        (_UINT32_(1) << 19)

/* ================== PORT definition for TCC4 peripheral =================== */
#define PIN_PA11F_TCC4_WO0                         _UINT32_(11)
#define MUX_PA11F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PA11F_TCC4_WO0                      ((PIN_PA11F_TCC4_WO0 << 16) | MUX_PA11F_TCC4_WO0)
#define PORT_PA11F_TCC4_WO0                        (_UINT32_(1) << 11)

#define PIN_PA13F_TCC4_WO0                         _UINT32_(13)
#define MUX_PA13F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PA13F_TCC4_WO0                      ((PIN_PA13F_TCC4_WO0 << 16) | MUX_PA13F_TCC4_WO0)
#define PORT_PA13F_TCC4_WO0                        (_UINT32_(1) << 13)

#define PIN_PB12F_TCC4_WO0                         _UINT32_(44)
#define MUX_PB12F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PB12F_TCC4_WO0                      ((PIN_PB12F_TCC4_WO0 << 16) | MUX_PB12F_TCC4_WO0)
#define PORT_PB12F_TCC4_WO0                        (_UINT32_(1) << 12)

#define PIN_PA12F_TCC4_WO1                         _UINT32_(12)
#define MUX_PA12F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PA12F_TCC4_WO1                      ((PIN_PA12F_TCC4_WO1 << 16) | MUX_PA12F_TCC4_WO1)
#define PORT_PA12F_TCC4_WO1                        (_UINT32_(1) << 12)

#define PIN_PA14F_TCC4_WO1                         _UINT32_(14)
#define MUX_PA14F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PA14F_TCC4_WO1                      ((PIN_PA14F_TCC4_WO1 << 16) | MUX_PA14F_TCC4_WO1)
#define PORT_PA14F_TCC4_WO1                        (_UINT32_(1) << 14)

/* ================== PORT definition for TCC5 peripheral =================== */
#define PIN_PA15F_TCC5_WO0                         _UINT32_(15)
#define MUX_PA15F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PA15F_TCC5_WO0                      ((PIN_PA15F_TCC5_WO0 << 16) | MUX_PA15F_TCC5_WO0)
#define PORT_PA15F_TCC5_WO0                        (_UINT32_(1) << 15)

#define PIN_PB00F_TCC5_WO0                         _UINT32_(32)
#define MUX_PB00F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PB00F_TCC5_WO0                      ((PIN_PB00F_TCC5_WO0 << 16) | MUX_PB00F_TCC5_WO0)
#define PORT_PB00F_TCC5_WO0                        (_UINT32_(1) << 0)

#define PIN_PA16F_TCC5_WO1                         _UINT32_(16)
#define MUX_PA16F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PA16F_TCC5_WO1                      ((PIN_PA16F_TCC5_WO1 << 16) | MUX_PA16F_TCC5_WO1)
#define PORT_PA16F_TCC5_WO1                        (_UINT32_(1) << 16)

#define PIN_PB01F_TCC5_WO1                         _UINT32_(33)
#define MUX_PB01F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PB01F_TCC5_WO1                      ((PIN_PB01F_TCC5_WO1 << 16) | MUX_PB01F_TCC5_WO1)
#define PORT_PB01F_TCC5_WO1                        (_UINT32_(1) << 1)

/* =================== PORT definition for USB peripheral =================== */
#define PIN_PD03H_USB_DM                           _UINT32_(99)
#define MUX_PD03H_USB_DM                           _UINT32_(7) 
#define PINMUX_PD03H_USB_DM                        ((PIN_PD03H_USB_DM << 16) | MUX_PD03H_USB_DM)
#define PORT_PD03H_USB_DM                          (_UINT32_(1) << 3)

#define PIN_PD04H_USB_DP                           _UINT32_(100)
#define MUX_PD04H_USB_DP                           _UINT32_(7) 
#define PINMUX_PD04H_USB_DP                        ((PIN_PD04H_USB_DP << 16) | MUX_PD04H_USB_DP)
#define PORT_PD04H_USB_DP                          (_UINT32_(1) << 4)

#define PIN_PC01H_USB_SOF_1KHZ                     _UINT32_(65)
#define MUX_PC01H_USB_SOF_1KHZ                     _UINT32_(7) 
#define PINMUX_PC01H_USB_SOF_1KHZ                  ((PIN_PC01H_USB_SOF_1KHZ << 16) | MUX_PC01H_USB_SOF_1KHZ)
#define PORT_PC01H_USB_SOF_1KHZ                    (_UINT32_(1) << 1)

#define PIN_PD02H_USB_SOF_1KHZ                     _UINT32_(98)
#define MUX_PD02H_USB_SOF_1KHZ                     _UINT32_(7) 
#define PINMUX_PD02H_USB_SOF_1KHZ                  ((PIN_PD02H_USB_SOF_1KHZ << 16) | MUX_PD02H_USB_SOF_1KHZ)
#define PORT_PD02H_USB_SOF_1KHZ                    (_UINT32_(1) << 2)



#endif /* _pic32ck1012sg00100_GPIO_H_ */

